import java.util.Scanner;

public class Task8 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
		 * Да се състави програма, която чете от конзолата 4-цифренo естествено
		 * число от интервала [1000.. 9999]. От това число се формират 2 нови
		 * 2-цифрени числа. Първото число се формира от 1-та и 4-та цифра на
		 * въведеното число. Второто число се формира от 2-рa - 3-та цифра на
		 * въведеното число. Като резултат да се изведе дали 1-то ново число e
		 * по-малко <, равно = или по-голямо от 2-то число. Пример: 3332 Изход:
		 * по-малко (32<33) Пример: 1144 Изход: равни (14=14) Пример: 9875
		 * Изход: по-голямо (95>87)
		 * 
		 */
		Scanner sc = new Scanner(System.in);
		System.out.println("Моля въведете цяло четирицифрено число");
		int a = sc.nextInt();
		while (a < 1000 || a > 9999) {
			System.out.println("Моля въведете цяло четирицифрено число (1000-9999)");
			a = sc.nextInt();
		}

		int a4 = a % 10;
		int a3 = (a / 10) % 10;
		int a2 = (a / 100) % 10;
		int a1 = a / 1000;

		int q = a1 * 10 + a4;
		int r = a2 * 10 + a3;

		if (q < r) {
			System.out.println("по-малко " + q + "<" + r);
		} else {
			if (q > r) {
				System.out.println("по-голямо " + q + ">" + r);
			} else {
				System.out.println("равни " + q + "=" + r);
			}
		}

	}

}
